src/cf/InformationRegisters/инт_МенеджерПотоковОтправкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_МенеджерПотоковОтправкиСообщений</Name>
			<Comment>Содержит информацию об активных потоках и их содержании</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СоставПотока</Name>
					<Comment>Строка содержащая сериализованные идентификаторы сообщений потока</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПотока</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПодписчиков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_ТипыПодписчиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ТекущийСтатусРассылкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ТекущийСтатусРассылкиСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СтатусыРассылкиИсходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСледующейПопытки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подписчик</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.инт_Подписчик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/инт_СтатусыРассылкиИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_СтатусыРассылкиИсходящихСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПроцессеОтправки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/инт_МенеджерПотоковОтправкиСообщений/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////

// инт_МенеджерПотоковОтправкиСообщений

//  

////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Собрать мусор
// 
// Процедура выполняет анализ содержимого регистра. Для каждого из существующих потоков проверяется его состояние. 
// Если поток не активен, но не удалился автоматически - он признается проблемным.
// Для проблемных потоков производится анализ сообщений. Если есть сообщения не обработанные потоком, то они возвращаются в общий пул сообщений к обработке. 
Процедура СобратьМусор() Экспорт
 	Выборка = РегистрыСведений.инт_МенеджерПотоковОтправкиСообщений.Выбрать();
    
    Пока Выборка.Следующий() Цикл
    	Поток = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПотока);
        Если Поток = Неопределено ИЛИ Не Поток.Состояние = СостояниеФоновогоЗадания.Активно Тогда
        	ОбработатьОткатПотока(Выборка.ИдентификаторПотока, Выборка.СоставПотока);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

// Процедура - Зарегистрировать поток
//
// Параметры:
//  ИдентификаторПотока     -   УникальныйИдентификатор   - Идентификатор фонового задания, реализующего поток.
//  МассивОбъектов         -   Массив   - Массив структур <ИдентификаторСообщения,Подписчик> обрабатываемых в потоке
//
Процедура ЗарегистрироватьПоток(ИдентификаторПотока, МассивОбъектов) Экспорт
    // Обогащаем структуры типом подписчика для корректной десериализации
    МассивДляСериализации = Новый Массив;
    Для Каждого Сообщение Из МассивОбъектов Цикл
        СтруктураДляСериализации = Новый Структура;
        СтруктураДляСериализации.Вставить("ИдентификаторСообщения", Сообщение.ИдентификаторСообщения);
        СтруктураДляСериализации.Вставить("Подписчик", Сообщение.Подписчик);
        СтруктураДляСериализации.Вставить("ТипПодписчика", Сообщение.Подписчик.Метаданные().Имя);
        МассивДляСериализации.Добавить(СтруктураДляСериализации);
    КонецЦикла;
    
	СоставПотока = инт_КоннекторHTTP.ОбъектВJson(МассивДляСериализации);
    Запись = РегистрыСведений.инт_МенеджерПотоковОтправкиСообщений.СоздатьМенеджерЗаписи();
    Запись.ИдентификаторПотока = ИдентификаторПотока;
    Запись.СоставПотока = СоставПотока;
    Запись.Записать();
    
КонецПроцедуры

Процедура ОбработатьЗавершениеРаботыПотока(ИдентификаторПотока) Экспорт
    ТекстСообщенияЖР = СтрШаблон("Поток с идентификатором <%1> успешно завершен", ИдентификаторПотока);
	УдалитьПотокИзМенеджера(ИдентификаторПотока);
    ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.МенеджерПотоковФормированияСообщений", УровеньЖурналаРегистрации.Информация,,,ТекстСообщенияЖР);
КонецПроцедуры

// Функция - Количество потоков к созданию
// 
// Возвращаемое значение:
// Число  - Количество потоков которое можно еще создать в системе.
//
Функция КоличествоПотоковКСозданию() Экспорт
	МаксимальноеКоличествоПотоков = инт_ОтправкаИсходящихСообщенийПовтИсп.КоличествоПотоковОтправкиСообщений();
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |    КОЛИЧЕСТВО(РАЗЛИЧНЫЕ инт_МенеджерПотоковОтправкиСообщений.ИдентификаторПотока) КАК КоличествоПотоков
                   |ИЗ
                   |    РегистрСведений.инт_МенеджерПотоковОтправкиСообщений КАК инт_МенеджерПотоковОтправкиСообщений";
    Выборка = Запрос.Выполнить().Выбрать();
    КоличествоПотоков = 0;
    Если Выборка.Следующий() Тогда
    	КоличествоПотоков = Выборка.КоличествоПотоков;
    КонецЕсли;
    
    Возврат ?(КоличествоПотоков >= МаксимальноеКоличествоПотоков, 0, МаксимальноеКоличествоПотоков - КоличествоПотоков);
КонецФункции
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ОбработатьОткатПотока(ИдентификаторПотока, СоставПотока)
    НачатьТранзакцию();
    Попытка
        Поток = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторПотока);
        Если Поток = Неопределено Тогда
            СообщениеОбОшибке = СтрШаблон("Поток с идентификатором <%1> не найден в списке фоновых заданий. Будет выполнен откат состава потока.",
            ИдентификаторПотока);
        Иначе
            СообщениеОбОшибке = СтрШаблон("Поток с идентификатором <%1> завершился не штатно.
            |
            |Состояние потока: %2
            |ИнформацияОбОшибке(Если есть): %3",
            Поток.УникальныйИдентификатор,
            Поток.Состояние,
            ?(Не Поток.ИнформацияОбОшибке = Неопределено, ПодробноеПредставлениеОшибки(Поток.ИнформацияОбОшибке),""));
        КонецЕсли;
        ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.МенеджерПотоковФормированияСообщений",УровеньЖурналаРегистрации.Ошибка, ,,СообщениеОбОшибке);
        
        УдалитьПотокИзМенеджера(ИдентификаторПотока);
        
        ОбработатьОткатСтатусаСообщений(СоставПотока);
         
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        СообщениеОбОшибке = СтрШаблон("При попытке обработки потока завершившегося с ошибкой с идентификатором <%1>, возникла ошибка.
        |
        | Информация об ошибке: %2", ИдентификаторПотока, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
        ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.МенеджерПотоковФормированияСообщений",УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
    КонецПопытки;
		
КонецПроцедуры

Процедура ОбработатьОткатСтатусаСообщений(СоставПотока)
    МассивСообщений = инт_КоннекторHTTP.JsonВОбъект(СоставПотока);

    Для Каждого Сообщение Из МассивСообщений Цикл
        ИдентификаторСообщения = Новый УникальныйИдентификатор(Сообщение.Получить("ИдентификаторСообщения"));
        Подписчик = ВосстановитьСсылкуПодписчика(Сообщение);
        Если Не ЗначениеЗаполнено(Подписчик) Тогда
            Продолжить;
        КонецЕсли;
        Статус = РегистрыСведений.инт_ТекущийСтатусРассылкиСообщений.ТекущийСтатусСообщения(ИдентификаторСообщения, Подписчик);
        // Если статус "ВПроцессеОтправки" значит фоновое задание по какой-то причине упало раньше,
        // чем обработало это сообщение. Аварийное завершение засчитывается выполненной попыткой:
        // сообщение, роняющее задание раз за разом, иначе возвращалось бы в пул бесконечно.
        Если Статус = Перечисления.инт_СтатусыРассылкиИсходящихСообщений.ВПроцессеОтправки Тогда
            ТекстОшибки = "Фоновое задание отправки завершалось аварийно. Число попыток отправки исчерпано.";
            НовыйСтатус = РегистрыСведений.инт_ТекущийСтатусРассылкиСообщений.ВернутьСообщениеВОчередь(
                ИдентификаторСообщения, Подписчик, ТекстОшибки);

            ТекстСообщенияЖР = СтрШаблон("Сообщение с идентификатором <%1> попало в поток который завершился аварийно. Ему присвоен статус <%2>",
                ИдентификаторСообщения, НовыйСтатус);
            ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.МенеджерПотоковФормированияСообщений", УровеньЖурналаРегистрации.Информация,,,ТекстСообщенияЖР);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

// Восстанавливает ссылку на подписчика из сериализованных данных
// Поддерживает как старый формат (только UUID), так и новый (ТипПодписчика + UUID)
Функция ВосстановитьСсылкуПодписчика(Сообщение)
    ПодписчикСтрока = Сообщение.Получить("Подписчик");
    ТипПодписчикаСтрока = Сообщение.Получить("ТипПодписчика");
    
    Возврат Справочники[ТипПодписчикаСтрока].ПолучитьСсылку(Новый УникальныйИдентификатор(ПодписчикСтрока));
КонецФункции

// Процедура - Удалить поток из менеджера
//
// Параметры:
//  ИдентификаторПотока  -   УникальныйИдентификтор   - УИД Фонового задания потока. Удаляется или при успешном завершении, или при сборке мусора.
//
Процедура УдалитьПотокИзМенеджера(ИдентификаторПотока)
   Запись = РегистрыСведений.инт_МенеджерПотоковОтправкиСообщений.СоздатьМенеджерЗаписи();
   Запись.ИдентификаторПотока = ИдентификаторПотока;
   Запись.Удалить();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
